stevenj/avr-libc3/include/avr/io/attiny104.h
/* Transmit Data Bit 8 */
#define USART_TXB8_CLEAR_gc (0x00) /* Transmit Data Bit 8 - CLEAR */
#define USART_TXB8_SET_gc   (0x01) /* Transmit Data Bit 8 - SET */


/* USART Mode Select */
#define USART_UMSEL_VAL_0x00_gc (0x00<<6) /* Asynchronous Operation */
#define USART_UMSEL_VAL_0x01_gc (0x01<<6) /* Synchronous Operation */


/* Parity Mode Bits */
#define USART_UPM_VAL_0x00_gc (0x00<<4) /* Disabled */
#define USART_UPM_VAL_0x01_gc (0x01<<4) /* Reserved */
#define USART_UPM_VAL_0x02_gc (0x02<<4) /* Enabled, Even Parity */
#define USART_UPM_VAL_0x03_gc (0x03<<4) /* Enabled, Odd Parity */


/* Stop Bit Select */
#define USART_USBS_VAL_0x00_gc (0x00<<3) /* 1-bit */
#define USART_USBS_VAL_0x01_gc (0x01<<3) /* 2-bit */


/* Character Size */
#define USART_UCSRC_UCSZ_gc(x) ((x<<1) & 0x06)

/* Clock Polarity */
#define USART_UCPOL_CLEAR_gc (0x00) /* Clock Polarity - CLEAR */
#define USART_UCPOL_SET_gc   (0x01) /* Clock Polarity - SET */


/* USART RX Start Interrupt Enable */
#define USART_RXSIE_CLEAR_gc (0x00) /* USART RX Start Interrupt Enable - CLEAR */
#define USART_RXSIE_SET_gc   (0x80) /* USART RX Start Interrupt Enable - SET */


/* USART RX Start Flag */
#define USART_RXS_CLEAR_gc (0x00) /* USART RX Start Flag - CLEAR */
#define USART_RXS_SET_gc   (0x40) /* USART RX Start Flag - SET */


/* Start frame detection enable */
#define USART_SFDE_CLEAR_gc (0x00) /* Start frame detection enable - CLEAR */
#define USART_SFDE_SET_gc   (0x20) /* Start frame detection enable - SET */


/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/


/* Watchdog Timer Interrupt Flag */
#define WDT_WDIF_CLEAR_gc (0x00) /* Watchdog Timer Interrupt Flag - CLEAR */
#define WDT_WDIF_SET_gc   (0x80) /* Watchdog Timer Interrupt Flag - SET */


/* Watchdog Timer Interrupt Enable */
#define WDT_WDIE_CLEAR_gc (0x00) /* Watchdog Timer Interrupt Enable - CLEAR */
#define WDT_WDIE_SET_gc   (0x40) /* Watchdog Timer Interrupt Enable - SET */


/* Watchdog Timer Prescaler Bits */
#define WDT_WDP_VAL_0x00_gc (0x00) /* Oscillator Cycles 2K */
#define WDT_WDP_VAL_0x01_gc (0x01) /* Oscillator Cycles 4K */
#define WDT_WDP_VAL_0x02_gc (0x02) /* Oscillator Cycles 8K */
#define WDT_WDP_VAL_0x03_gc (0x03) /* Oscillator Cycles 16K */
#define WDT_WDP_VAL_0x04_gc (0x04) /* Oscillator Cycles 32K */
#define WDT_WDP_VAL_0x05_gc (0x05) /* Oscillator Cycles 64K */
#define WDT_WDP_VAL_0x06_gc (0x06) /* Oscillator Cycles 128K */
#define WDT_WDP_VAL_0x07_gc (0x07) /* Oscillator Cycles 256K */
#define WDT_WDP_VAL_0x08_gc (0x08) /* Oscillator Cycles 512K */
#define WDT_WDP_VAL_0x09_gc (0x09) /* Oscillator Cycles 1024K */


/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE        _SFR_MEM8 (0x0000) /* ADC Base Address */
#define ADC_DIDR0       _SFR_MEM8 (0x0017) /* Digital Input Disable Register */
#define ADC_ADCL        _SFR_MEM8 (0x0019) /* ADC Data Register Low */
#define ADC_ADCH        _SFR_MEM8 (0x001A) /* ADC Data Register High */
#define ADC_ADMUX       _SFR_MEM8 (0x001B) /* The ADC multiplexer Selection Register */
#define ADC_ADCSRB      _SFR_MEM8 (0x001C) /* The ADC Control and Status register B */
#define ADC_ADCSRA      _SFR_MEM8 (0x001D) /* The ADC Control and Status register A */

/* AC - Analog Comparator (0x0000) */
#define AC_BASE         _SFR_MEM8 (0x0000) /* AC Base Address */
#define AC_DIDR0        _SFR_MEM8 (0x0017) 
#define AC_ACSRB        _SFR_MEM8 (0x001E) /* Analog Comparator Control And Status Register B */
#define AC_ACSRA        _SFR_MEM8 (0x001F) /* Analog Comparator Control And Status Register A */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_NVMCSR      _SFR_MEM8 (0x0032) /* Non-Volatile Memory Control and Status Register */
#define CPU_NVMCMD      _SFR_MEM8 (0x0033) /* Non-Volatile Memory Command */
#define CPU_VLMCSR      _SFR_MEM8 (0x0034) /* Vcc Level Monitoring Control and Status Register */
#define CPU_PRR         _SFR_MEM8 (0x0035) /* Power Reduction Register */
#define CPU_CLKPSR      _SFR_MEM8 (0x0036) /* Clock Prescale Register */
#define CPU_CLKMSR      _SFR_MEM8 (0x0037) /* Clock Main Settings Register */
#define CPU_OSCCAL      _SFR_MEM8 (0x0039) /* Oscillator Calibration Value */
#define CPU_SMCR        _SFR_MEM8 (0x003A) /* Sleep Mode Control Register */
#define CPU_RSTFLR      _SFR_MEM8 (0x003B) /* Reset Flag Register */
#define CPU_CCP         _SFR_MEM8 (0x003C) /* Configuration Change Protection */
#define CPU_SP          _SFR_MEM16(0x003D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x003D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x003E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x003F) /* Status Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE     _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA     _SFR_MEM8 (0x0000) /* Input Pins, Port A */
#define PORTAA_DDRA     _SFR_MEM8 (0x0001) /* Data Direction Register, Port A */
#define PORTAA_PORTA    _SFR_MEM8 (0x0002) /* Port A Data register */
#define PORTAA_PUEA     _SFR_MEM8 (0x0003) /* Pull-up Enable Control Register for PORTA */
#define PORTAA_PORTCR   _SFR_MEM8 (0x0016) /* Port Control Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0004) /* Input Pins, Port B */
#define PORTBB_DDRB     _SFR_MEM8 (0x0005) /* Data Direction Register, Port B */
#define PORTBB_PORTB    _SFR_MEM8 (0x0006) /* Port B Data register */
#define PORTBB_PUEB     _SFR_MEM8 (0x0007) /* Pull-up Enable Control Register for PORTB */
#define PORTBB_PORTCR   _SFR_MEM8 (0x0016) /* Port Control Register */

